#include "FunctionsReload.h"
#include "Print.cpp"
#include "Sort.cpp"
#include "Sum.cpp"
#include "Avg.cpp"
#include "minValueIn.cpp"
#include "maxValueIn.cpp"

/*Прототипы функций (Functions declaration) обьявлены в файлах FunctionsReload.h;
Реализация функций (Functions realisation) обьявлена в файлах:
Avg.cpp
FillRand.cpp
maxValueIn.cpp
minValueIn.cpp
Print.cpp
Sort.cpp
Sum.cpp*/

#define INT_ARR1
#define DOUBLE_ARR1
#define CHAR_ARR1
#define INT_ARR2
#define DOUBLE_ARR2
#define CHAR_ARR2

void main()
{
	setlocale(LC_ALL, "Russian"); //set russian lang in locale
	cout << "**************************************FUNCTIONS IN C++ (ФУНКЦИИ В C++)*************************************" << endl;
	cout << "\t\t\tОДНОМЕРНЫЕ МАССИВЫ:" << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
#if defined INT_ARR1
	cout << "\t\t\Int" << endl;
	const int n = 5;
	int Arr[n];
	cout << "*********************************************************************************************" << endl;
	FillRand(Arr, n);
	Print(Arr, n);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	Sort(Arr, n);
	Print(Arr, n);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	cout << "Сумма элементов массива: " << Sum(Arr, n) << endl;
	cout << "Среднее арифметическое : " << Avg(Arr, n) << endl;
	cout << "Минимальное значение в массиве: " << minValueIn(Arr, n) << endl;
	cout << "Максимальное значение в массиве: " << maxValueIn(Arr, n) << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
#endif
	
#if defined DOUBLE_ARR1
	cout << "\t\t\Double" << endl;
	const int m = 10;
	double Brr[m];
	cout << "*********************************************************************************************" << endl;
	FillRand(Brr, m);
	Print(Brr, m);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	Sort(Brr, m);
	Print(Brr, m);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	cout << "Сумма элементов массива: " << Sum(Brr, m) << endl;
	cout << "Среднее арифметическое : " << Avg(Brr, m) << endl;
	cout << "Минимальное значение в массиве: " << minValueIn(Brr, m) << endl;
	cout << "Максимальное значение в массиве: " << maxValueIn(Brr, m) << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
#endif

#if defined CHAR_ARR1
	cout << "\t\t\Char" << endl;
	const int SIZE = 10;
	char Crr[SIZE];
	cout << "*********************************************************************************************" << endl;
	FillRand(Crr, SIZE);
	Print(Crr, SIZE);
	cout << "---------------------------------------------------------------------------------------------" << endl;
#endif

	cout << "*********************************************************************************************" << endl;
	cout << "\t\t\tДВУХМЕРНЫЕ МАССИВЫ:" << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;

#if defined INT_ARR2
	cout << "\t\t\INT" << endl;
	int Drr[ROWS][COLS] =
	{
		{1, 2, 3},
		{4, 5, 6},
		{7, 8, 9}
	};
	Print(Drr);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	FillRand(Drr);
	Print(Drr);
	cout << "---------------------------------------------------------------------------------------------";
	cout << "Сумма элементов массива: " << Sum(Drr);
	cout << "Среднее арифметическое массива : " << Avg(Drr) << endl;
	cout << "Минимальное значение в массиве: " << minValueIn(Drr) << endl;
	cout << "Максимальное значение в массиве: " << maxValueIn(Drr) << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
#endif

#if defined DOUBLE_ARR2
	cout << "\t\t\DOUBLE" << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
	double Frr[ROWS][COLS];
	FillRand(Frr);
	Print(Frr);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	Sort(Frr);
	Print(Frr);
	cout << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
	cout << "Сумма элементов массива: " << Sum(Frr) << endl;
	cout << "Среднее арифметическое массива " << Avg(Frr) << endl;
	cout << "Минимальное значение в массиве: " << minValueIn(Frr) << endl;
	cout << "Максимальное значение в массиве: " << maxValueIn(Frr) << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
#endif

#if defined CHAR_ARR2
	cout << "\t\t\CHAR" << endl;
	cout << "---------------------------------------------------------------------------------------------" << endl;
	char Grr[ROWS][COLS];
	FillRand(Grr);
	Print(Grr);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	Sort(Grr);
	Print(Grr);
	cout << "---------------------------------------------------------------------------------------------" << endl;
	//cout << "Сумма элементов массива: " << Sum(Grr) << endl;
	//cout << "Среднее арифметическое массива: " << Avg(Grr) << endl;
	cout << "Минимальное значение в массиве: " << minValueIn(Grr) << endl;
	cout << "Максимальное значение в массиве: " << maxValueIn(Grr) << endl;
#endif

	cout << "*********************************************************************************************" << endl;
	cout << "\t\t\tДА ПРИБУДЕТ С ВАМИ СИЛА!!!" << endl;
}